adamkondraciuk/nrfx/mdk/nrf54h20_engb_bbpr_peripherals.h
#define PWM131_EASYDMA5 1                            /*!< (unspecified)                                                        */
#define PWM131_EASYDMATEMP 0                         /*!< (unspecified)                                                        */
#define PWM131_IDLE_OUT 1                            /*!< (unspecified)                                                        */
#define PWM131_COMPARE_MATCH 1                       /*!< (unspecified)                                                        */
#define PWM131_FEATURES_V2 0                         /*!< (unspecified)                                                        */
#define PWM131_NO_FEATURES_V2 1                      /*!< (unspecified)                                                        */
#define PWM131_EASYDMALISTINCLUDED 0                 /*!< (unspecified)                                                        */
#define PWM131_EASYDMAMODEINCLUDED 0                 /*!< (unspecified)                                                        */
#define PWM131_EASYDMAFULLLPMODEINCLUDED 0           /*!< (unspecified)                                                        */
#define PWM131_EASYDMAPATTERNMATCHERINCLUDED 0       /*!< (unspecified)                                                        */
#define PWM131_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1 /*!< (unspecified)                                                   */
#define PWM131_EASYDMASTOPTASKINCLUDED 1             /*!< (unspecified)                                                        */

#define PWM132_EASYDMA5 1                            /*!< (unspecified)                                                        */
#define PWM132_EASYDMATEMP 0                         /*!< (unspecified)                                                        */
#define PWM132_IDLE_OUT 1                            /*!< (unspecified)                                                        */
#define PWM132_COMPARE_MATCH 1                       /*!< (unspecified)                                                        */
#define PWM132_FEATURES_V2 0                         /*!< (unspecified)                                                        */
#define PWM132_NO_FEATURES_V2 1                      /*!< (unspecified)                                                        */
#define PWM132_EASYDMALISTINCLUDED 0                 /*!< (unspecified)                                                        */
#define PWM132_EASYDMAMODEINCLUDED 0                 /*!< (unspecified)                                                        */
#define PWM132_EASYDMAFULLLPMODEINCLUDED 0           /*!< (unspecified)                                                        */
#define PWM132_EASYDMAPATTERNMATCHERINCLUDED 0       /*!< (unspecified)                                                        */
#define PWM132_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1 /*!< (unspecified)                                                   */
#define PWM132_EASYDMASTOPTASKINCLUDED 1             /*!< (unspecified)                                                        */

#define PWM133_EASYDMA5 1                            /*!< (unspecified)                                                        */
#define PWM133_EASYDMATEMP 0                         /*!< (unspecified)                                                        */
#define PWM133_IDLE_OUT 1                            /*!< (unspecified)                                                        */
#define PWM133_COMPARE_MATCH 1                       /*!< (unspecified)                                                        */
#define PWM133_FEATURES_V2 0                         /*!< (unspecified)                                                        */
#define PWM133_NO_FEATURES_V2 1                      /*!< (unspecified)                                                        */
#define PWM133_EASYDMALISTINCLUDED 0                 /*!< (unspecified)                                                        */
#define PWM133_EASYDMAMODEINCLUDED 0                 /*!< (unspecified)                                                        */
#define PWM133_EASYDMAFULLLPMODEINCLUDED 0           /*!< (unspecified)                                                        */
#define PWM133_EASYDMAPATTERNMATCHERINCLUDED 0       /*!< (unspecified)                                                        */
#define PWM133_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1 /*!< (unspecified)                                                   */
#define PWM133_EASYDMASTOPTASKINCLUDED 1             /*!< (unspecified)                                                        */

/*SPI Slave*/
#define SPIS_PRESENT 1
#define SPIS_COUNT 9

#define SPIS120_LEGACYPSEL 0                         /*!< (unspecified)                                                        */
#define SPIS120_LEGACYEDMA 0                         /*!< (unspecified)                                                        */
#define SPIS120_EASYDMA_MAXCNT_MIN 0                 /*!< (unspecified)                                                        */
#define SPIS120_EASYDMA_MAXCNT_MAX 15                /*!< (unspecified)                                                        */
#define SPIS120_EASYDMA_MAXCNT_SIZE 16               /*!< (unspecified)                                                        */
#define SPIS120_EASYDMA5 1                           /*!< (unspecified)                                                        */
#define SPIS120_EASYDMATEMP 0                        /*!< (unspecified)                                                        */
#define SPIS120_EASYDMALISTINCLUDED 1                /*!< (unspecified)                                                        */
#define SPIS120_EASYDMAMODEINCLUDED 0                /*!< (unspecified)                                                        */
#define SPIS120_EASYDMAFULLLPMODEINCLUDED 0          /*!< (unspecified)                                                        */
#define SPIS120_EASYDMAPATTERNMATCHERINCLUDED 1      /*!< (unspecified)                                                        */
#define SPIS120_EASYDMANUMMATCHCHANNELS_MIN 0        /*!< EasyDMA pattern matching engine supports events 0..3.                */
#define SPIS120_EASYDMANUMMATCHCHANNELS_MAX 3        /*!< EasyDMA pattern matching engine supports events 0..3.                */
#define SPIS120_EASYDMANUMMATCHCHANNELS_SIZE 4       /*!< EasyDMA pattern matching engine supports events 0..3.                */
#define SPIS120_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1 /*!< (unspecified)                                                  */
#define SPIS120_EASYDMASTOPTASKINCLUDED 1            /*!< (unspecified)                                                        */

